// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка)

int num = 6;
int divider = 2;
int result = num / divider;
Console.Write(result);