// Напишите программу , 
// которая на вход принимает два числа и выдает , 
// какое число большее, акакое меньшее.

Console.WriteLine("Введите первое число");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число");
int b = Convert.ToInt32(Console.ReadLine());



if (a > b) 
{
     Console.WriteLine("Первое число больше второго");
   
} 
else 
{
     Console.WriteLine("Второе число больше первого"); // Не могу понять как дописать программу, чтобы она выводила на экран не текст а цифры.
     

     
}

