// Задача 19: Напишите программу, которая принимает 
//на вход пятизначное число и проверяет является ли это число палиндромом.
// 12821 - ДА.
// 14678 - НЕТ.
// 34743 - ДА.

Console.WriteLine(" number ");
int num = int.Parse(Console.ReadLine());
/// пока нет идей как решить задачу. Вернусь позже.

